{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Post Graduate Certificate in Project Management",
      "department": "Project Management",
      "duration": "2022-2024",
      "school_name": "Algoma University"
    },
    {
      "awards_achievements": [
        "First class with Distinction"
      ],
      "degree": "Bachelor of Engineering",
      "department": "Electrical and Electronics Engineering",
      "duration": "2002-2006",
      "school_name": "Anna University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_UmaraniKumaresan",
  "highlighted_projects": [
    {
      "description": "Worked on projects like a Dealer Management System providing functionalities for member registration, order management, and inventory tracking. Developed REST services and database procedures for a Dashboard. Also contributed to a Visit Management System, capturing location details for account managers visiting shops. The technologies used are Figma for prototype, React for web, Reat native for app,Spring boot Rest APIs and Oracle.",
      "name": "Dealer Management System"
    },
    {
      "description": "Developed a Student Management System with features including student registration, attendance tracking, allergy lists, academic reports, extracurricular activities, medical records, family contacts, and messaging for arrival, parent pickup, or bus drop-off. The technologies used Figma (UI design), Spring boot, Java , Oracle, Linux, Redhat,  Openshift",
      "name": "School Management System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Cluster Monitor Agent that allows users to monitor and store hardware specifications and usage data for multiple Linux systems using bash scripts. The monitoring agent, when installed on each node, automatically collects hardware information and resource usage data from the server and persists it to the PostgreSQL database provisioned using Docker. Implemented Git for version control and used GitHub as the central repository, enabling effective code review and collaboration among team members.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Gained expertise in developing and managing relational databases using PostgreSQL. Proficient in performing CRUD operations, data modeling, and applying normalization and denormalization principles. Designed advanced SQL queries for data manipulation and extraction, utilizing techniques such as joins, subqueries, and aggregations to manage data relationships and conduct in-depth analysis. Acquired a solid understanding of key database concepts, including entity relationships, primary and foreign keys, and normalization forms.",
      "git_url": "/sql",
      "name": "RDBMS and SQL"
    },
    {
      "description": [
        "Grep App: Developed a Java-based grep application for text pattern searching in files. Initially built with basic functionality, it was later optimized using Lambda and Stream APIs for improved performance and memory efficiency. The application handles large files effectively and was containerized using Docker for consistent deployment across environments, showcasing expertise in Java, modern APIs, and containerization.",
        "StockQuote App: This Application is a Personal Stock Wallet that allows users to effortlessly buy, sell, and track all their stocks in one place. This acts as a central repository for all the company stocks utilizing PostgreSQL via JDBC. This app is portable across all platforms."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a data analytics pipeline for a UK-based online giftware retailer to analyze transactional data using Python, Pandas, NumPy, and Matplotlib. Extracted insights on sales trends, customer behavior, and marketing optimization through data cleaning, feature engineering, and exploratory data analysis (EDA). Identified revenue fluctuations, customer retention patterns, and seasonal sales trends. Conducted RFM (Recency, Frequency, Monetary) analysis to segment customers into categories such as \"Loyal Customers\" and \"At Risk,\" enhancing targeted marketing strategies. Ensured data integrity, accurate visualizations, and modular code, delivering a reproducible and scalable analysis documented in Jupyter Notebook and deployed via GitHub.",
      "git_url": "/feature/python",
      "name": "Python Data Analytics"
    },
    {
      "description": "Designed and implemented a scalable big data processing solution on Google Cloud Platform (GCP) using Dataproc. Integrated Apache Zeppelin to enable interactive analytics and utilized the Hive interpreter for SQL-based querying of distributed datasets. The solution delivers enterprise-grade real-time analytics and efficient data processing.",
      "git_url": "/feature/python",
      "name": "Hadoop"
    },
    {
      "description": "Conducted data analysis on the World Development Indicators (WDI) and retail datasets using Zeppelin notebooks on GCP Dataproc and Azure Databricks. Utilized PySpark to process large-scale distributed data efficiently. Extracted key economic indicators such as country-wise GDP from the WDI dataset, and derived actionable business insights from the retail dataset, including total revenue, sales trends, and new monthly user metrics to support strategic growth decisions.",
      "git_url": "/feature/python",
      "name": "Spark"
    }
  ],
  "name": "Umarani Kumaresan",
  "others": [
    {
      "bullets": [
        "Volunteer at Miniskool - Early Childhood Education",
        "Volunteer teaching Tamil at Tamil Sangam"
      ],
      "title": "Activities"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "At Jarvis, I am part of a cross-functional team, working collaboratively to design, develop, and implement software systems. With my strong skills in Java and SQL, I am responsible for writing high-quality, efficient, and scalable code. The technologies used includes Docker, Linux/Bash, Git, and GitHub to manage the software development process and ensure code reliability. I am dedicated to delivering software features that meet the requirements, and I am always up to date with the latest industry trends and best practices. Additionally, I actively participate in Agile development processes, using the Scrum methodology to meet project deadlines and deliver high-quality software solutions.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Infoline Oman",
      "description": "Actively participated in Agile ceremonies, driving project success and team collaboration. Experienced in developing and scaling Java-based web applications. Collaborated with cross-functional teams to deliver high-quality software solutions. Proficient in translating business requirements into technical solutions, creating comprehensive documentation, and facilitating review sessions.  Introduced process improvements, reducing project delivery time and enhancing software quality.",
      "duration": "2016-2022",
      "title": "Software Developer"
    },
    {
      "company": "Oman Computer Services",
      "description": "Facilitated user acceptance and functional testing, ensuring a seamless user experience while reducing project risks through proactive mitigation. Conducted cross-browser compatibility testing, resolved all UI issues, and collaborated with off-site teams, reducing project completion time. Developed custom UI test script templates and defect trackers and reduced defects.",
      "duration": "2010-2016",
      "title": "Quality Analyst"
    },
    {
      "company": "Slash Support",
      "description": "Provided technical support for Linksys products, resolving customer issues on first contact. Resolved technical issues, maintained accurate customer records, and ensured data integrity.",
      "duration": "2006-2009",
      "title": "Technical Support Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "Redhat Openshift, Microsoft Azure and Windows server",
      "Rest APIs",
      "Jira",
      "HDFS",
      "Springboot",
      "JavaScript",
      "Kanban"
    ],
    "familiar": [
      "HTML",
      "CSS",
      "JQuery",
      "Jenkins",
      "Confluence",
      "Clickup",
      "Asana"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git and Github",
      "PySpark ETL and Data Processing",
      "Databricks"
    ]
  },
  "summary": "I have completed a Postgraduate Degree in Project Management from Algoma University, Canada, and hold a Bachelor's Degree in Electrical and Electronics Engineering from Anna University, India. Currently, I am a Software and Data Engineer at Jarvis Technologies Group Inc., where I leverage my skills to develop and deploy efficient and effective software systems. During my postgraduate program, I was a peer tutor, providing individual and small-group lectures to fellow students. I have a proven track record in communication with strong expertise in managing product backlogs, tracking team velocity, and delivering incremental value in an Agile environment. I am well-versed in facilitating Sprint Planning, Daily Stand-ups, Sprint Reviews, and Retrospectives, ensuring effective collaboration and communication within diverse teams. I also have strong technical skills and a solid proficiency in Java, relational databases, and cloud platforms, including Microsoft Azure and Redhat Openshift. Skilled in system support across Unix/Linux and Windows Server, with hands-on experience in CI/CD tools like Jenkins, GitHub, and Artifactory. I greatly enjoy organizing and overcoming technical challenges, exploring new technologies, and developing and supporting software across various platforms."
}
